In [7]:
#Excercise 4
#1
import pandas as pd
x=pd.Series([10,20,"Python",500,"Program"])
print(x)

0         10
1         20
2     Python
3        500
4    Program
dtype: object

In [14]:
#2
import pandas as pd  
per1 = pd.date_range(start ='5-1-2021', 
         end ='5-12-2021')
print(per1)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [17]:
#3
import pandas as pd
details = {
    'Name' : ['Subhadra', 'Sindhya', 'Theertha', 'Vaisakh'],
    'Age' : [23, 21, 22, 21],
    'University' : ['MGU', 'MGU', 'CALICUT', 'KU'],
}
df = pd.DataFrame(details)
print(df)

       Name  Age University
0  Subhadra   23        MGU
1   Sindhya   21        MGU
2  Theertha   22    CALICUT
3   Vaisakh   21         KU

In [45]:
#4
import pandas as pd  
lst = [['Python', 25], ['is', 30], 
       ['very', 26], ['easy', 22]] 
df = pd.DataFrame(lst, columns =['Tag', 'Number']) 
print(df )

      Tag  Number
0  Python      25
1      is      30
2    very      26
3    easy      22

In [21]:
#5
import pandas as pd
x=pd.read_csv('ex4.csv')
print(x)

   Id    Flowers
0   1       Rose
1   2      Lotus
2   3       Lily
3   4    Jasmine
4   5  Rufflasia

In [24]:
#6
import pandas as pd
df=pd.DataFrame({'Name':['Subhadra','Sindhya','Theertha','Vaisakh'],
                'Age':[22,24,23,21],
               'Course':['MCA','BTECH','MSW','MSC']})
df.sort_values(by=['Age'], ascending=True)

       Name  Age Course
3   Vaisakh   21    MSC
0  Subhadra   22    MCA
2  Theertha   23    MSW
1   Sindhya   24  BTECH

In [47]:
#7
import pandas as pd
data={'Name':['Subhadra','Sindhya','Theertha','Vaisakh'],
                'Age':[22,24,23,21],
               'Course':['MCA','BTECH','MSW','MSC']}
index={1,2,3,4}
df=pd.DataFrame(data,index)
df.reset_index(inplace = True)
print(df)

   index      Name  Age Course
0      1  Subhadra   22    MCA
1      2   Sindhya   24  BTECH
2      3  Theertha   23    MSW
3      4   Vaisakh   21    MSC

In [29]:
#8
import pandas as pd
data={'Name':['Subhadra','Sindhya','Theertha','Vaisakh'],
                'Age':[22,24,23,21],
               'Course':['MCA','BTECH','MSW','MSC']}
index={1,2,3,4}
df=pd.DataFrame(data,index)
df1=df.head(2)
print(df1)

       Name  Age Course
1  Subhadra   22    MCA
2   Sindhya   24  BTECH

In [32]:
#9
import pandas as pd
data={'Name':['Subhadra','Sindhya','Theertha','Vaisakh','Vineeth','Kavya'],
                'Occupation':['Engineer','Doctor','Engineer','Doctor','Doctor','Engineer'],
               'Salary':[50000,40000,56000,48000,45000,50000]}
df=pd.DataFrame(data)
print(df)
occ_average_age = df.groupby('Occupation')['Salary'].mean() 
print(occ_average_age)

       Name Occupation  Salary
0  Subhadra   Engineer   50000
1   Sindhya     Doctor   40000
2  Theertha   Engineer   56000
3   Vaisakh     Doctor   48000
4   Vineeth     Doctor   45000
5     Kavya   Engineer   50000
Occupation
Doctor      44333.333333
Engineer    52000.000000
Name: Salary, dtype: float64

In [36]:
#10
import numpy as np
import pandas as pd
data={'Name':['Subhadra','Sindhya','Theertha','Vaisakh','Vineeth','Kavya'],
                'Occupation':['Engineer','Doctor','Engineer','Doctor','Doctor','Engineer'],
               'Salary':[np.nan,40000,56000,48000,np.nan,50000]}
df=pd.DataFrame(data)
print(df)
print("-----Updated dataframe----- ")
df1=df.fillna(0)
print(df1)

       Name Occupation   Salary
0  Subhadra   Engineer      NaN
1   Sindhya     Doctor  40000.0
2  Theertha   Engineer  56000.0
3   Vaisakh     Doctor  48000.0
4   Vineeth     Doctor      NaN
5     Kavya   Engineer  50000.0
-----Updated dataframe-----
       Name Occupation   Salary
0  Subhadra   Engineer      0.0
1   Sindhya     Doctor  40000.0
2  Theertha   Engineer  56000.0
3   Vaisakh     Doctor  48000.0
4   Vineeth     Doctor      0.0
5     Kavya   Engineer  50000.0

In [40]:
#11
import pandas as pd
data={'Cname':['Wipro','Cognizant','TCS','Capgemini','Virtusa'],
              'Profit':[-120000,200000,-500000,-400000,300000]}
df=pd.DataFrame(data)
print(df)
print("----Updated dataframe")
df['profit'] = df['profit'].apply(lambda x:x>0)
print(df)

       cname  profit
0      Wipro -120000
1  Cognizant  200000
2        TCS -500000
3  Capgemini -400000
4    Virtusa  300000
----Updated dataframe
       cname  profit
0      Wipro   False
1  Cognizant    True
2        TCS   False
3  Capgemini   False
4    Virtusa    True

In [48]:
#12
import pandas as pd
data1={'eid':[1,2,3,4],
              'ename':['Subhadra','Sindhya','Theertha','Vaisakh'],
     'stipend':[10000,5000,15000,20000]}
print("---First dataframe---")
df1=pd.DataFrame(data1)
print(df1)
data2={'eid':[1,2,3,4],
      'designation':['engineer','senior employee','intern employee','engineer']}
df2=pd.DataFrame(data2)
print("---Second dataframe---")
print(df2)
dataframe = pd.merge(df1,df2, how = 'inner', on = 'eid')
print("---Merged dataframe---")
print(dataframe)

---First dataframe---
   eid     ename  stipend
0    1  Subhadra    10000
1    2   Sindhya     5000
2    3  Theertha    15000
3    4   Vaisakh    20000
---Second dataframe---
   eid      designation
0    1         engineer
1    2  senior employee
2    3  intern employee
3    4         engineer
---Merged dataframe---
   eid     ename  stipend      designation
0    1  Subhadra    10000         engineer
1    2   Sindhya     5000  senior employee
2    3  Theertha    15000  intern employee
3    4   Vaisakh    20000         engineer